; domain
(define (domain blocksworld)
  (:requirements :strips)
(:predicates (clear ?x)
             (on-table ?x)
             (arm-empty)
             (holding ?x)
             (on ?x ?y))

(:action pickup
  :parameters (?ob)
  :precondition (and (clear ?ob) (on-table ?ob) (arm-empty))
  :effect (and (holding ?ob) (not (clear ?ob)) (not (on-table ?ob))
               (not (arm-empty))))

(:action putdown
  :parameters  (?ob)
  :precondition (holding ?ob)
  :effect (and (clear ?ob) (arm-empty) (on-table ?ob)
               (not (holding ?ob))))

(:action stack
  :parameters  (?ob ?underob)
  :precondition (and (clear ?underob) (holding ?ob))
  :effect (and (arm-empty) (clear ?ob) (on ?ob ?underob)
               (not (clear ?underob)) (not (holding ?ob))))

(:action unstack
  :parameters  (?ob ?underob)
  :precondition (and (on ?ob ?underob) (clear ?ob) (arm-empty))
  :effect (and (holding ?ob) (clear ?underob)
               (not (on ?ob ?underob)) (not (clear ?ob)) (not (arm-empty)))))

; problem
;; blocks=115, out_folder=htg/blocksworld/training, instance_id=95, seed=2119, goal_proportion=0.1

(define (problem blocksworld-95)
 (:domain blocksworld)
 (:objects b1 b2 b3 b4 b5 b6 b7 b8 b9 b10 b11 b12 b13 b14 b15 b16 b17 b18 b19 b20 b21 b22 b23 b24 b25 b26 b27 b28 b29 b30 b31 b32 b33 b34 b35 b36 b37 b38 b39 b40 b41 b42 b43 b44 b45 b46 b47 b48 b49 b50 b51 b52 b53 b54 b55 b56 b57 b58 b59 b60 b61 b62 b63 b64 b65 b66 b67 b68 b69 b70 b71 b72 b73 b74 b75 b76 b77 b78 b79 b80 b81 b82 b83 b84 b85 b86 b87 b88 b89 b90 b91 b92 b93 b94 b95 b96 b97 b98 b99 b100 b101 b102 b103 b104 b105 b106 b107 b108 b109 b110 b111 b112 b113 b114 b115 - object)
 (:init 
    (arm-empty)
    (clear b9)
    (on b9 b27)
    (on b27 b100)
    (on b100 b10)
    (on b10 b105)
    (on b105 b50)
    (on b50 b54)
    (on b54 b112)
    (on b112 b91)
    (on b91 b58)
    (on b58 b52)
    (on b52 b15)
    (on-table b15)
    (clear b16)
    (on b16 b87)
    (on b87 b102)
    (on b102 b47)
    (on b47 b70)
    (on b70 b42)
    (on b42 b46)
    (on b46 b37)
    (on b37 b38)
    (on-table b38)
    (clear b103)
    (on-table b103)
    (clear b98)
    (on b98 b64)
    (on-table b64)
    (clear b85)
    (on b85 b40)
    (on-table b40)
    (clear b30)
    (on-table b30)
    (clear b55)
    (on-table b55)
    (clear b21)
    (on b21 b83)
    (on b83 b14)
    (on b14 b101)
    (on b101 b11)
    (on b11 b71)
    (on b71 b68)
    (on b68 b95)
    (on b95 b45)
    (on b45 b80)
    (on b80 b67)
    (on b67 b25)
    (on b25 b35)
    (on b35 b77)
    (on b77 b96)
    (on b96 b81)
    (on-table b81)
    (clear b72)
    (on-table b72)
    (clear b51)
    (on-table b51)
    (clear b26)
    (on b26 b22)
    (on b22 b59)
    (on-table b59)
    (clear b56)
    (on b56 b24)
    (on b24 b108)
    (on-table b108)
    (clear b90)
    (on-table b90)
    (clear b49)
    (on b49 b20)
    (on b20 b29)
    (on b29 b31)
    (on b31 b93)
    (on b93 b114)
    (on b114 b82)
    (on b82 b74)
    (on b74 b78)
    (on b78 b13)
    (on-table b13)
    (clear b4)
    (on b4 b106)
    (on-table b106)
    (clear b76)
    (on-table b76)
    (clear b34)
    (on-table b34)
    (clear b86)
    (on-table b86)
    (clear b44)
    (on b44 b19)
    (on b19 b97)
    (on b97 b41)
    (on b41 b62)
    (on b62 b60)
    (on b60 b109)
    (on-table b109)
    (clear b43)
    (on b43 b32)
    (on-table b32)
    (clear b12)
    (on b12 b2)
    (on b2 b113)
    (on b113 b65)
    (on b65 b115)
    (on b115 b5)
    (on b5 b17)
    (on b17 b110)
    (on-table b110)
    (clear b6)
    (on b6 b69)
    (on b69 b48)
    (on-table b48)
    (clear b61)
    (on b61 b18)
    (on b18 b3)
    (on b3 b75)
    (on b75 b89)
    (on-table b89)
    (clear b39)
    (on b39 b33)
    (on b33 b92)
    (on b92 b57)
    (on b57 b53)
    (on-table b53)
    (clear b7)
    (on b7 b8)
    (on b8 b111)
    (on b111 b28)
    (on b28 b63)
    (on b63 b66)
    (on b66 b79)
    (on b79 b84)
    (on-table b84)
    (clear b88)
    (on b88 b104)
    (on b104 b99)
    (on b99 b1)
    (on b1 b94)
    (on-table b94)
    (clear b73)
    (on b73 b36)
    (on b36 b107)
    (on-table b107)
    (clear b23)
    (on-table b23))
 (:goal  (and 
    (clear b7)
    (on-table b7)
    (clear b4)
    (on b4 b11)
    (on b11 b2)
    (on b2 b1)
    (on b1 b3)
    (on-table b3)
    (clear b8)
    (on-table b8)
    (clear b6)
    (on b6 b10)
    (on-table b10)
    (clear b5)
    (on b5 b9)
    (on-table b9))))

; plan
1. (unstack b9 b27)
   deleted: (on b9 b27) (clear b9) (arm-empty)
   added: (holding b9) (clear b27)
   goals met: 3 of 16
2. (putdown b9)
   deleted: (holding b9)
   added: (clear b9) (arm-empty) (on-table b9)
   goals met: 4 of 16
3. (unstack b7 b8)
   deleted: (on b7 b8) (clear b7) (arm-empty)
   added: (holding b7) (clear b8)
   goals met: 4 of 16
4. (putdown b7)
   deleted: (holding b7)
   added: (clear b7) (arm-empty) (on-table b7)
   goals met: 6 of 16
5. (unstack b8 b111)
   deleted: (on b8 b111) (clear b8) (arm-empty)
   added: (holding b8) (clear b111)
   goals met: 5 of 16
6. (putdown b8)
   deleted: (holding b8)
   added: (clear b8) (arm-empty) (on-table b8)
   goals met: 7 of 16
7. (unstack b61 b18)
   deleted: (on b61 b18) (clear b61) (arm-empty)
   added: (holding b61) (clear b18)
   goals met: 7 of 16
8. (putdown b61)
   deleted: (holding b61)
   added: (clear b61) (arm-empty) (on-table b61)
   goals met: 7 of 16
9. (unstack b18 b3)
   deleted: (on b18 b3) (clear b18) (arm-empty)
   added: (holding b18) (clear b3)
   goals met: 7 of 16
10. (putdown b18)
   deleted: (holding b18)
   added: (clear b18) (arm-empty) (on-table b18)
   goals met: 7 of 16
11. (unstack b3 b75)
   deleted: (on b3 b75) (clear b3) (arm-empty)
   added: (holding b3) (clear b75)
   goals met: 7 of 16
12. (putdown b3)
   deleted: (holding b3)
   added: (clear b3) (arm-empty) (on-table b3)
   goals met: 8 of 16
13. (unstack b27 b100)
   deleted: (on b27 b100) (clear b27) (arm-empty)
   added: (holding b27) (clear b100)
   goals met: 8 of 16
14. (putdown b27)
   deleted: (holding b27)
   added: (clear b27) (arm-empty) (on-table b27)
   goals met: 8 of 16
15. (unstack b100 b10)
   deleted: (on b100 b10) (clear b100) (arm-empty)
   added: (holding b100) (clear b10)
   goals met: 8 of 16
16. (putdown b100)
   deleted: (holding b100)
   added: (clear b100) (arm-empty) (on-table b100)
   goals met: 8 of 16
17. (unstack b10 b105)
   deleted: (on b10 b105) (clear b10) (arm-empty)
   added: (holding b10) (clear b105)
   goals met: 8 of 16
18. (putdown b10)
   deleted: (holding b10)
   added: (clear b10) (arm-empty) (on-table b10)
   goals met: 9 of 16
19. (unstack b6 b69)
   deleted: (on b6 b69) (clear b6) (arm-empty)
   added: (holding b6) (clear b69)
   goals met: 8 of 16
20. (stack b6 b10)
   deleted: (clear b10) (holding b6)
   added: (arm-empty) (clear b6) (on b6 b10)
   goals met: 10 of 16
21. (unstack b88 b104)
   deleted: (on b88 b104) (clear b88) (arm-empty)
   added: (holding b88) (clear b104)
   goals met: 10 of 16
22. (putdown b88)
   deleted: (holding b88)
   added: (clear b88) (arm-empty) (on-table b88)
   goals met: 10 of 16
23. (unstack b104 b99)
   deleted: (on b104 b99) (clear b104) (arm-empty)
   added: (holding b104) (clear b99)
   goals met: 10 of 16
24. (putdown b104)
   deleted: (holding b104)
   added: (clear b104) (arm-empty) (on-table b104)
   goals met: 10 of 16
25. (unstack b99 b1)
   deleted: (on b99 b1) (clear b99) (arm-empty)
   added: (holding b99) (clear b1)
   goals met: 10 of 16
26. (putdown b99)
   deleted: (holding b99)
   added: (clear b99) (arm-empty) (on-table b99)
   goals met: 10 of 16
27. (unstack b1 b94)
   deleted: (on b1 b94) (clear b1) (arm-empty)
   added: (holding b1) (clear b94)
   goals met: 10 of 16
28. (stack b1 b3)
   deleted: (clear b3) (holding b1)
   added: (arm-empty) (clear b1) (on b1 b3)
   goals met: 11 of 16
29. (unstack b12 b2)
   deleted: (on b12 b2) (clear b12) (arm-empty)
   added: (holding b12) (clear b2)
   goals met: 11 of 16
30. (putdown b12)
   deleted: (holding b12)
   added: (clear b12) (arm-empty) (on-table b12)
   goals met: 11 of 16
31. (unstack b2 b113)
   deleted: (on b2 b113) (clear b2) (arm-empty)
   added: (holding b2) (clear b113)
   goals met: 11 of 16
32. (stack b2 b1)
   deleted: (clear b1) (holding b2)
   added: (arm-empty) (clear b2) (on b2 b1)
   goals met: 12 of 16
33. (unstack b113 b65)
   deleted: (on b113 b65) (clear b113) (arm-empty)
   added: (holding b113) (clear b65)
   goals met: 12 of 16
34. (putdown b113)
   deleted: (holding b113)
   added: (clear b113) (arm-empty) (on-table b113)
   goals met: 12 of 16
35. (unstack b65 b115)
   deleted: (on b65 b115) (clear b65) (arm-empty)
   added: (holding b65) (clear b115)
   goals met: 12 of 16
36. (putdown b65)
   deleted: (holding b65)
   added: (clear b65) (arm-empty) (on-table b65)
   goals met: 12 of 16
37. (unstack b115 b5)
   deleted: (on b115 b5) (clear b115) (arm-empty)
   added: (holding b115) (clear b5)
   goals met: 13 of 16
38. (putdown b115)
   deleted: (holding b115)
   added: (clear b115) (arm-empty) (on-table b115)
   goals met: 13 of 16
39. (unstack b5 b17)
   deleted: (on b5 b17) (clear b5) (arm-empty)
   added: (holding b5) (clear b17)
   goals met: 12 of 16
40. (stack b5 b9)
   deleted: (clear b9) (holding b5)
   added: (arm-empty) (clear b5) (on b5 b9)
   goals met: 14 of 16
41. (unstack b21 b83)
   deleted: (on b21 b83) (clear b21) (arm-empty)
   added: (holding b21) (clear b83)
   goals met: 14 of 16
42. (putdown b21)
   deleted: (holding b21)
   added: (clear b21) (arm-empty) (on-table b21)
   goals met: 14 of 16
43. (unstack b83 b14)
   deleted: (on b83 b14) (clear b83) (arm-empty)
   added: (holding b83) (clear b14)
   goals met: 14 of 16
44. (putdown b83)
   deleted: (holding b83)
   added: (clear b83) (arm-empty) (on-table b83)
   goals met: 14 of 16
45. (unstack b14 b101)
   deleted: (on b14 b101) (clear b14) (arm-empty)
   added: (holding b14) (clear b101)
   goals met: 14 of 16
46. (putdown b14)
   deleted: (holding b14)
   added: (clear b14) (arm-empty) (on-table b14)
   goals met: 14 of 16
47. (unstack b101 b11)
   deleted: (on b101 b11) (clear b101) (arm-empty)
   added: (holding b101) (clear b11)
   goals met: 14 of 16
48. (putdown b101)
   deleted: (holding b101)
   added: (clear b101) (arm-empty) (on-table b101)
   goals met: 14 of 16
49. (unstack b11 b71)
   deleted: (on b11 b71) (clear b11) (arm-empty)
   added: (holding b11) (clear b71)
   goals met: 14 of 16
50. (stack b11 b2)
   deleted: (clear b2) (holding b11)
   added: (arm-empty) (clear b11) (on b11 b2)
   goals met: 15 of 16
51. (unstack b4 b106)
   deleted: (on b4 b106) (clear b4) (arm-empty)
   added: (holding b4) (clear b106)
   goals met: 14 of 16
52. (stack b4 b11)
   deleted: (clear b11) (holding b4)
   added: (arm-empty) (clear b4) (on b4 b11)
   goals met: 16 of 16
